---
kind: method
id: M:Autodesk.Revit.DB.Form.DeleteSubElement(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/83a0b23d-f14f-2aa2-6add-83abdb2b47ce.htm
---
# Autodesk.Revit.DB.Form.DeleteSubElement Method

**中文**: 对话框、窗口、窗体

Delete a face/edge/curve/vertex of the form, specified by a reference.

## Syntax (C#)
```csharp
public void DeleteSubElement(
	Reference subElementReference
)
```

## Parameters
- **subElementReference** (`Autodesk.Revit.DB.Reference`) - The geometry reference of face/edge/curve/vertex